// 5)შექმენით for loop-ი, რომელიც რიცხვებს დაითვლის 25-დან 60-მდე
for(let i = 25; i <= 60; i++) {
    console.log(i)
}

// 6)შექმენით for loop-ი, რომელიც რიცხვებს 55-დან 30-მდე დაითვლის, 5-5 რიცხვის გამოკლებით
for(let y = 55; y >= 30; y -= 5){
    console.log(y)
}

// 7) შექმენიტ პროგრამა while ციკლის გამოყენებით, რომელიც დაბეჭდავს რიცხვებს 10-დან 100-მდე
let z = 10
while (z <= 100){
    console.log(z)
    z += 1;
}

// 8)გადმოგეცემათ სია let numbers = [5, 12, 8, 130, 44,2,9,111,102] for loop ის გამოყენებიტ ამოიღეთ მხოლოდ ლუწი რიცხვები და დააბრუნეთ ისინი
let numbers = [5, 12, 8, 130, 44,2,9,111,102]
let nums = []
for(let x = 0; x < numbers.length; x++)
{
    if(numbers[x] % 2 == 0) {
        nums.push(numbers[x])
    }
}

console.log(nums)