// 1)კომენტარების სახით ახსენით თუ რაგანსხვავებაა let სა და const შორის
// const არის ცვლადი რომელიც უნდა მივანიჭოთ და let არის ცვლადი რომელში შეგვიძლია მნიშვნელობის შეცვლა
// const არ შეუძლია მნიშვნელობის შეცვლა let შეუძლია მნიშვნელობის შეცვლა

// 2)შექმენით ცვლადები მათთში შეინახეთ თქვენი სახელი,გვარი,ასაკი,ქალაქი და შემდეგ დაბეჭდეთ ცვლადებში შენახული ინფორმაცია
const myname = "Giorgi"
const lastname = "kandelaki"
const age = 12
const city = "tbilisi"
console.log(myname)
console.log(lastname)
console.log(age)
console.log(city)

// 3)კომენტარების სახით ახსენით თუ რასაკეთებს .push(),.pop(),.shift(),.concat(),.slice()
// push ელემენტს ამატებს pop ბოლო სიტყვას შლის shift პირველ ელემენტს შლის concat სიებს აერთიანებს slice ამოიღბს ელემენტებს ინდექსიდან

// 4)კომეტარების სახით  ახსენით როგორ მუშაობს for loop-ი. ასევე დაწერეთ რამდენი არგუმენტი გადაეცემა მას და თითოეული არგუმენტი რას ასრულებს
// for loop იმეორებს კოდს სადამდეც გვინდა
// for loop გადაეცემა start იწყება for loop, end არის დასასრული for loop-ის, step ნაბიჯი ანუ რამდენი რიცხვიტ გინდა გადავგათ for loop-ის 

// 9)კომენტარების სახით ახსენით თუ რაარის forEach და რასაკეთებს ის
// foreach არის რომელიც მასივის თითოელ ელემენტზე გადადის მოქმედებას ასრულებს და გვაძლევს წვდომას